#### 180309

### 예제
1. 상관관계 행렬
2. 대장균 max달
3. A형간염 많은 순 정렬
4. 콜레라 기준 순위
5. 각 질병별 발병횟수 총합
6. null을 이전행 값으로 바꾸기
7. null있는 행 삭제

In [13]:
# !start .

In [3]:
from pandas import DataFrame
import pandas as pd
import numpy as np

In [12]:
# !dir

In [ ]:
# disss= pd.read_table('./data/disease.txt', encoding= 'cp949')

##### 파일 깔끔하게 부르기
원래 파일에 칼럼 구분이 space로 되어있어서 다 붙어버렸는데, sep옵션을 \s+ 로 주면 예쁘게 들어옴

In [11]:
disss= pd.read_table('disease.txt',encoding='cp949', sep='\s+')
disss

     월별   콜레라   장티푸스     이질    대장균    A형간염
0    1월   6.0  175.0  550.0    7.0   351.0
1    2월   5.0  165.0  253.0    9.0   535.0
2    3월   1.0  200.0    NaN   13.0  1003.0
3    4월   1.0  200.0  507.0    NaN   856.0
4    5월   1.0  194.0  343.0   27.0   959.0
5    6월   3.0  227.0  272.0   92.0   928.0
6    7월  14.0  179.0  224.0  201.0   630.0
7    8월   NaN  163.0  347.0  114.0   505.0
8    9월   3.0    NaN  105.0   43.0   364.0
9   10월   1.0  107.0  142.0   39.0   230.0
10  11월   3.0   97.0  377.0   27.0   190.0
11  12월   4.0  121.0  679.0   21.0     NaN

#### 1

In [155]:
disss.head(1)

   월별  콜레라   장티푸스     이질  대장균   A형간염
0  1월  6.0  175.0  550.0  7.0  351.0

In [156]:
#문자열 데이터인 월별 빼고 숫자 데이터만 반영
disss.corr()

           콜레라      장티푸스        이질       대장균      A형간염
콜레라   1.000000  0.028276 -0.074796  0.769566 -0.166091
장티푸스  0.028276  1.000000 -0.049797  0.242710  0.888711
이질   -0.074796 -0.049797  1.000000 -0.324529  0.196159
대장균   0.769566  0.242710 -0.324529  1.000000  0.117524
A형간염 -0.166091  0.888711  0.196159  0.117524  1.000000

#### 2

In [17]:
disss[disss['대장균']==max(disss['대장균'])]

   월별   콜레라   장티푸스     이질    대장균   A형간염
6  7월  14.0  179.0  224.0  201.0  630.0

##### 오늘 배운 거로

In [127]:
# 최대값을 갖고 있는 인덱스(행) 이름 - 이건 월이 아니라 행번호!
disss['대장균'].idxmax()

6

In [131]:
disss.iloc[disss['대장균'].idxmax()]

월별       7월
콜레라      14
장티푸스    179
이질      224
대장균     201
A형간염    630
Name: 6, dtype: object

In [130]:
disss.iloc[disss['대장균'].idxmax()]['월별']

'7월'

In [133]:
disss.iloc[disss['대장균'].idxmax()].월별

'7월'

In [132]:
disss.월별

0      1월
1      2월
2      3월
3      4월
4      5월
5      6월
6      7월
7      8월
8      9월
9     10월
10    11월
11    12월
Name: 월별, dtype: object

In [134]:
disss['월별']

0      1월
1      2월
2      3월
3      4월
4      5월
5      6월
6      7월
7      8월
8      9월
9     10월
10    11월
11    12월
Name: 월별, dtype: object

#### 3

In [30]:
disss.sort_values(by='A형간염', ascending= False)

     월별   콜레라   장티푸스     이질    대장균    A형간염
2    3월   1.0  200.0    NaN   13.0  1003.0
4    5월   1.0  194.0  343.0   27.0   959.0
5    6월   3.0  227.0  272.0   92.0   928.0
3    4월   1.0  200.0  507.0    NaN   856.0
6    7월  14.0  179.0  224.0  201.0   630.0
1    2월   5.0  165.0  253.0    9.0   535.0
7    8월   NaN  163.0  347.0  114.0   505.0
8    9월   3.0    NaN  105.0   43.0   364.0
0    1월   6.0  175.0  550.0    7.0   351.0
9   10월   1.0  107.0  142.0   39.0   230.0
10  11월   3.0   97.0  377.0   27.0   190.0
11  12월   4.0  121.0  679.0   21.0     NaN

#### 4

In [47]:
disss.sort_values(by='콜레라', ascending= False)

     월별   콜레라   장티푸스     이질    대장균    A형간염
6    7월  14.0  179.0  224.0  201.0   630.0
0    1월   6.0  175.0  550.0    7.0   351.0
1    2월   5.0  165.0  253.0    9.0   535.0
11  12월   4.0  121.0  679.0   21.0     NaN
5    6월   3.0  227.0  272.0   92.0   928.0
8    9월   3.0    NaN  105.0   43.0   364.0
10  11월   3.0   97.0  377.0   27.0   190.0
2    3월   1.0  200.0    NaN   13.0  1003.0
3    4월   1.0  200.0  507.0    NaN   856.0
4    5월   1.0  194.0  343.0   27.0   959.0
9   10월   1.0  107.0  142.0   39.0   230.0
7    8월   NaN  163.0  347.0  114.0   505.0

In [39]:
disss['콜레라']#.rank(method='first')

0      6.0
1      5.0
2      1.0
3      1.0
4      1.0
5      3.0
6     14.0
7      NaN
8      3.0
9      1.0
10     3.0
11     4.0
Name: 콜레라, dtype: float64

In [42]:
disss.rank?

In [135]:
disss['콜레라']

0      6.0
1      5.0
2      1.0
3      1.0
4      1.0
5      3.0
6     14.0
7      NaN
8      3.0
9      1.0
10     3.0
11     4.0
Name: 콜레라, dtype: float64

In [136]:
disss['콜레라'].rank(method='first')

0     10.0
1      9.0
2      1.0
3      2.0
4      3.0
5      5.0
6     11.0
7      NaN
8      6.0
9      4.0
10     7.0
11     8.0
Name: 콜레라, dtype: float64

In [52]:
disss['콜레라'].rank(method='first', ascending= False)

0      2.0
1      3.0
2      8.0
3      9.0
4     10.0
5      5.0
6      1.0
7      NaN
8      6.0
9     11.0
10     7.0
11     4.0
Name: 콜레라, dtype: float64

In [54]:
disss['콜레라'].rank(method='average', ascending= False)

0     2.0
1     3.0
2     9.5
3     9.5
4     9.5
5     6.0
6     1.0
7     NaN
8     6.0
9     9.5
10    6.0
11    4.0
Name: 콜레라, dtype: float64

#### 강사님코드

In [143]:
disss.rank()['콜레라']

0     10.0
1      9.0
2      2.5
3      2.5
4      2.5
5      6.0
6     11.0
7      NaN
8      6.0
9      2.5
10     6.0
11     8.0
Name: 콜레라, dtype: float64

In [142]:
disss.rank(ascending=False)['콜레라'].sort_values()

6     1.0
0     2.0
1     3.0
11    4.0
5     6.0
8     6.0
10    6.0
2     9.5
3     9.5
4     9.5
9     9.5
7     NaN
Name: 콜레라, dtype: float64

#### 5

In [55]:
disss.head(1)

   월별  콜레라   장티푸스     이질  대장균   A형간염
0  1월  6.0  175.0  550.0  7.0  351.0

In [86]:
# type(disss)
disss.iloc[:,2:]

     장티푸스     이질    대장균    A형간염
0   175.0  550.0    7.0   351.0
1   165.0  253.0    9.0   535.0
2   200.0    NaN   13.0  1003.0
3   200.0  507.0    NaN   856.0
4   194.0  343.0   27.0   959.0
5   227.0  272.0   92.0   928.0
6   179.0  224.0  201.0   630.0
7   163.0  347.0  114.0   505.0
8     NaN  105.0   43.0   364.0
9   107.0  142.0   39.0   230.0
10   97.0  377.0   27.0   190.0
11  121.0  679.0   21.0     NaN

In [84]:
disss.iloc[:,2:].sum(0)

장티푸스    1828.0
이질      3799.0
대장균      593.0
A형간염    6551.0
dtype: float64

#### 6

In [97]:
disss.head(4)

   월별  콜레라   장티푸스     이질   대장균    A형간염
0  1월  6.0  175.0  550.0   7.0   351.0
1  2월  5.0  165.0  253.0   9.0   535.0
2  3월  1.0  200.0    NaN  13.0  1003.0
3  4월  1.0  200.0  507.0   NaN   856.0

In [88]:
disss.ffill()

     월별   콜레라   장티푸스     이질    대장균    A형간염
0    1월   6.0  175.0  550.0    7.0   351.0
1    2월   5.0  165.0  253.0    9.0   535.0
2    3월   1.0  200.0  253.0   13.0  1003.0
3    4월   1.0  200.0  507.0   13.0   856.0
4    5월   1.0  194.0  343.0   27.0   959.0
5    6월   3.0  227.0  272.0   92.0   928.0
6    7월  14.0  179.0  224.0  201.0   630.0
7    8월  14.0  163.0  347.0  114.0   505.0
8    9월   3.0  163.0  105.0   43.0   364.0
9   10월   1.0  107.0  142.0   39.0   230.0
10  11월   3.0   97.0  377.0   27.0   190.0
11  12월   4.0  121.0  679.0   21.0   190.0

#### 7

In [123]:
disss.dropna().shape

(7, 6)

In [98]:
disss.dropna()

     월별   콜레라   장티푸스     이질    대장균   A형간염
0    1월   6.0  175.0  550.0    7.0  351.0
1    2월   5.0  165.0  253.0    9.0  535.0
4    5월   1.0  194.0  343.0   27.0  959.0
5    6월   3.0  227.0  272.0   92.0  928.0
6    7월  14.0  179.0  224.0  201.0  630.0
9   10월   1.0  107.0  142.0   39.0  230.0
10  11월   3.0   97.0  377.0   27.0  190.0

In [100]:
disss.shape

(12, 6)

##### NA가 하나라도 포함되있는 행 모두 출력?

In [118]:
disss.isnull()

       월별    콜레라   장티푸스     이질    대장균   A형간염
0   False  False  False  False  False  False
1   False  False  False  False  False  False
2   False  False  False   True  False  False
3   False  False  False  False   True  False
4   False  False  False  False  False  False
5   False  False  False  False  False  False
6   False  False  False  False  False  False
7   False   True  False  False  False  False
8   False  False   True  False  False  False
9   False  False  False  False  False  False
10  False  False  False  False  False  False
11  False  False  False  False  False   True

In [114]:
disss.isnull().any()

월별      False
콜레라      True
장티푸스     True
이질       True
대장균      True
A형간염     True
dtype: bool

[.any(1)](https://stackoverflow.com/questions/14247586/python-pandas-how-to-select-rows-with-one-or-more-nulls-from-a-dataframe-without)

In [116]:
disss.isnull().any(1)

0     False
1     False
2      True
3      True
4     False
5     False
6     False
7      True
8      True
9     False
10    False
11     True
dtype: bool

In [119]:
disss[disss.isnull().any(1)]

     월별  콜레라   장티푸스     이질    대장균    A형간염
2    3월  1.0  200.0    NaN   13.0  1003.0
3    4월  1.0  200.0  507.0    NaN   856.0
7    8월  NaN  163.0  347.0  114.0   505.0
8    9월  3.0    NaN  105.0   43.0   364.0
11  12월  4.0  121.0  679.0   21.0     NaN

In [122]:
disss.isnull().any(1).sum()

5

In [112]:
# 내가 원하는 게 X
# disss.sort_values(na_position= 'first', by=['콜레라','장티푸스'])

#### 강사님 코드
속도는 데이터['칼럼명'].메소드 순서가 빠름

In [145]:
f=pd.read_table('data/disease.txt',encoding='cp949', sep='\s+')
f

     월별   콜레라   장티푸스     이질    대장균    A형간염
0    1월   6.0  175.0  550.0    7.0   351.0
1    2월   5.0  165.0  253.0    9.0   535.0
2    3월   1.0  200.0    NaN   13.0  1003.0
3    4월   1.0  200.0  507.0    NaN   856.0
4    5월   1.0  194.0  343.0   27.0   959.0
5    6월   3.0  227.0  272.0   92.0   928.0
6    7월  14.0  179.0  224.0  201.0   630.0
7    8월   NaN  163.0  347.0  114.0   505.0
8    9월   3.0    NaN  105.0   43.0   364.0
9   10월   1.0  107.0  142.0   39.0   230.0
10  11월   3.0   97.0  377.0   27.0   190.0
11  12월   4.0  121.0  679.0   21.0     NaN

In [150]:
f1=f.iloc[:,1:]; f1

     콜레라   장티푸스     이질    대장균    A형간염
0    6.0  175.0  550.0    7.0   351.0
1    5.0  165.0  253.0    9.0   535.0
2    1.0  200.0    NaN   13.0  1003.0
3    1.0  200.0  507.0    NaN   856.0
4    1.0  194.0  343.0   27.0   959.0
5    3.0  227.0  272.0   92.0   928.0
6   14.0  179.0  224.0  201.0   630.0
7    NaN  163.0  347.0  114.0   505.0
8    3.0    NaN  105.0   43.0   364.0
9    1.0  107.0  142.0   39.0   230.0
10   3.0   97.0  377.0   27.0   190.0
11   4.0  121.0  679.0   21.0     NaN

#####  첫 칼럼을 인덱스(행)로 넣음

In [152]:
i1= f.iloc[:,0]
print(i1)
f1.index=i1; f1

0      1월
1      2월
2      3월
3      4월
4      5월
5      6월
6      7월
7      8월
8      9월
9     10월
10    11월
11    12월
Name: 월별, dtype: object

      콜레라   장티푸스     이질    대장균    A형간염
월별
1월    6.0  175.0  550.0    7.0   351.0
2월    5.0  165.0  253.0    9.0   535.0
3월    1.0  200.0    NaN   13.0  1003.0
4월    1.0  200.0  507.0    NaN   856.0
5월    1.0  194.0  343.0   27.0   959.0
6월    3.0  227.0  272.0   92.0   928.0
7월   14.0  179.0  224.0  201.0   630.0
8월    NaN  163.0  347.0  114.0   505.0
9월    3.0    NaN  105.0   43.0   364.0
10월   1.0  107.0  142.0   39.0   230.0
11월   3.0   97.0  377.0   27.0   190.0
12월   4.0  121.0  679.0   21.0     NaN

In [153]:
f1.corr()

           콜레라      장티푸스        이질       대장균      A형간염
콜레라   1.000000  0.028276 -0.074796  0.769566 -0.166091
장티푸스  0.028276  1.000000 -0.049797  0.242710  0.888711
이질   -0.074796 -0.049797  1.000000 -0.324529  0.196159
대장균   0.769566  0.242710 -0.324529  1.000000  0.117524
A형간염 -0.166091  0.888711  0.196159  0.117524  1.000000

In [174]:
# f1.idxmax()
# f1.idxmax()['대장균']
# f1.sort_values(by='A형간염')
# f1.sort_values(by='A형간염',ascending=False)
# f1.rank()
# f1.rank()['콜레라']
# f1.rank(ascending=False)['콜레라']
# f1.rank(ascending=False)['콜레라'].sort_values()
# f1.sum()
# f1.fillna(method='ffill')
# f1.dropna()
# f1.dropna(how='all')

In [157]:
f1.idxmax()

콜레라      7월
장티푸스     6월
이질      12월
대장균      7월
A형간염     3월
dtype: object

In [158]:
f1.idxmax()['대장균']

'7월'

In [160]:
f1['대장균'].idxmax()

'7월'

In [164]:
# f1.sort_values(by='A형간염')
f1.sort_values(by='A형간염',ascending=False)

      콜레라   장티푸스     이질    대장균    A형간염
월별
3월    1.0  200.0    NaN   13.0  1003.0
5월    1.0  194.0  343.0   27.0   959.0
6월    3.0  227.0  272.0   92.0   928.0
4월    1.0  200.0  507.0    NaN   856.0
7월   14.0  179.0  224.0  201.0   630.0
2월    5.0  165.0  253.0    9.0   535.0
8월    NaN  163.0  347.0  114.0   505.0
9월    3.0    NaN  105.0   43.0   364.0
1월    6.0  175.0  550.0    7.0   351.0
10월   1.0  107.0  142.0   39.0   230.0
11월   3.0   97.0  377.0   27.0   190.0
12월   4.0  121.0  679.0   21.0     NaN

### rank
아 헷갈려

In [180]:
# disss.iloc[:,1:].rank()
f1.rank()

      콜레라  장티푸스    이질   대장균  A형간염
월별
1월   10.0   6.0  10.0   1.0   3.0
2월    9.0   5.0   4.0   2.0   6.0
3월    2.5   9.5   NaN   3.0  11.0
4월    2.5   9.5   9.0   NaN   8.0
5월    2.5   8.0   6.0   5.5  10.0
6월    6.0  11.0   5.0   9.0   9.0
7월   11.0   7.0   3.0  11.0   7.0
8월    NaN   4.0   7.0  10.0   5.0
9월    6.0   NaN   1.0   8.0   4.0
10월   2.5   2.0   2.0   7.0   2.0
11월   6.0   1.0   8.0   5.5   1.0
12월   8.0   3.0  11.0   4.0   NaN

In [182]:
disss.rank()['콜레라']

0     10.0
1      9.0
2      2.5
3      2.5
4      2.5
5      6.0
6     11.0
7      NaN
8      6.0
9      2.5
10     6.0
11     8.0
Name: 콜레라, dtype: float64

In [183]:
f1.rank()['콜레라']

월별
1월     10.0
2월      9.0
3월      2.5
4월      2.5
5월      2.5
6월      6.0
7월     11.0
8월      NaN
9월      6.0
10월     2.5
11월     6.0
12월     8.0
Name: 콜레라, dtype: float64

In [186]:
disss.rank(ascending=False)['콜레라']

0     2.0
1     3.0
2     9.5
3     9.5
4     9.5
5     6.0
6     1.0
7     NaN
8     6.0
9     9.5
10    6.0
11    4.0
Name: 콜레라, dtype: float64

In [184]:
f1.rank(ascending=False)['콜레라']

월별
1월     2.0
2월     3.0
3월     9.5
4월     9.5
5월     9.5
6월     6.0
7월     1.0
8월     NaN
9월     6.0
10월    9.5
11월    6.0
12월    4.0
Name: 콜레라, dtype: float64

In [188]:
disss.rank(ascending=False)['콜레라'].sort_values()

6     1.0
0     2.0
1     3.0
11    4.0
5     6.0
8     6.0
10    6.0
2     9.5
3     9.5
4     9.5
9     9.5
7     NaN
Name: 콜레라, dtype: float64

In [187]:
f1.rank(ascending=False)['콜레라'].sort_values()

월별
7월     1.0
1월     2.0
2월     3.0
12월    4.0
6월     6.0
9월     6.0
11월    6.0
3월     9.5
4월     9.5
5월     9.5
10월    9.5
8월     NaN
Name: 콜레라, dtype: float64

#### rank 의미- 결론
왼쪽이 행, 오른쪽이 순위 1,2,3...,11위

In [191]:
disss.iloc[:,1:].rank(ascending=False, method='first')['콜레라'].sort_values()

6      1.0
0      2.0
1      3.0
11     4.0
5      5.0
8      6.0
10     7.0
2      8.0
3      9.0
4     10.0
9     11.0
7      NaN
Name: 콜레라, dtype: float64

In [189]:
f1.rank(ascending=False, method='first')['콜레라'].sort_values()

월별
7월      1.0
1월      2.0
2월      3.0
12월     4.0
6월      5.0
9월      6.0
11월     7.0
3월      8.0
4월      9.0
5월     10.0
10월    11.0
8월      NaN
Name: 콜레라, dtype: float64

In [167]:
f1.sum()

콜레라       42.0
장티푸스    1828.0
이질      3799.0
대장균      593.0
A형간염    6551.0
dtype: float64

In [173]:
# disss
disss[disss.isnull().any(1)]

     월별  콜레라   장티푸스     이질    대장균    A형간염
2    3월  1.0  200.0    NaN   13.0  1003.0
3    4월  1.0  200.0  507.0    NaN   856.0
7    8월  NaN  163.0  347.0  114.0   505.0
8    9월  3.0    NaN  105.0   43.0   364.0
11  12월  4.0  121.0  679.0   21.0     NaN

In [169]:
#내 코드
disss.ffill()

     월별   콜레라   장티푸스     이질    대장균    A형간염
0    1월   6.0  175.0  550.0    7.0   351.0
1    2월   5.0  165.0  253.0    9.0   535.0
2    3월   1.0  200.0  253.0   13.0  1003.0
3    4월   1.0  200.0  507.0   13.0   856.0
4    5월   1.0  194.0  343.0   27.0   959.0
5    6월   3.0  227.0  272.0   92.0   928.0
6    7월  14.0  179.0  224.0  201.0   630.0
7    8월  14.0  163.0  347.0  114.0   505.0
8    9월   3.0  163.0  105.0   43.0   364.0
9   10월   1.0  107.0  142.0   39.0   230.0
10  11월   3.0   97.0  377.0   27.0   190.0
11  12월   4.0  121.0  679.0   21.0   190.0

In [168]:
f1.fillna(method='ffill')

      콜레라   장티푸스     이질    대장균    A형간염
월별
1월    6.0  175.0  550.0    7.0   351.0
2월    5.0  165.0  253.0    9.0   535.0
3월    1.0  200.0  253.0   13.0  1003.0
4월    1.0  200.0  507.0   13.0   856.0
5월    1.0  194.0  343.0   27.0   959.0
6월    3.0  227.0  272.0   92.0   928.0
7월   14.0  179.0  224.0  201.0   630.0
8월   14.0  163.0  347.0  114.0   505.0
9월    3.0  163.0  105.0   43.0   364.0
10월   1.0  107.0  142.0   39.0   230.0
11월   3.0   97.0  377.0   27.0   190.0
12월   4.0  121.0  679.0   21.0   190.0

In [ ]:
f1.dropna()
f1.dropna(how='all')